Revit 2027 API
ExportLayerInfo.GetCutLayerModifiers Method
 Gets all the cut layer modifiers from the layer info.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<LayerModifier> GetCutLayerModifiers()
Public Function GetCutLayerModifiers As IList(Of LayerModifier)
public:
IList<LayerModifier^>^ GetCutLayerModifiers()
member GetCutLayerModifiers : unit -> IList<LayerModifier>
Return Value
IList<LayerModifier>
 The cut layer modifier array.
See Also
Reference
ExportLayerInfo Class
Autodesk.Revit.DB Namespace